import os

# ==========================================
# НАСТРОЙКИ ДЛЯ RENDER (Environment Variables)
# ==========================================
# Эти данные НЕ НУЖНО вписывать сюда. 
# Вы добавите их в панели управления Render в разделе Environment Variables.

# Токен вашего бота (получаем у @BotFather)
BOT_TOKEN = os.getenv("BOT_TOKEN")

# ID главного администратора (@xoyli)
# Если ID не будет найден, бот по умолчанию установит 0 (чтобы не было ошибки)
ADMIN_ID = int(os.getenv("ADMIN_ID", 0))

# ==========================================
# ОБЫЧНЫЕ НАСТРОЙКИ (Можно менять тут)
# ==========================================

# Главный канал (без @), который НЕЛЬЗЯ удалить
MAIN_CHANNEL = "voodoo_channels"

# Ссылка на ваш Telegram канал
CHANNEL_LINK = f"https://t.me/{MAIN_CHANNEL}"
